{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.6.0", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "4"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}}}, "modelTopology": {"node": [{"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/conv2d_7/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/conv2d_7/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_8/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_8/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/conv2d_10/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/conv2d_10/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_11/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_11/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/mul", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape_2/shape", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape/shape", "op": "Const", "input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1/start", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/ExpandDims/dim", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/mul", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape_6/shape/3", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/Const", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice/stack_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/strided_slice_1/stack_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape/3", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape/4", "op": "Const", "input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Const", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape/shape/1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1/delta", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_1/stack", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/combined_non_max_suppression/CombinedNonMaxSuppression/max_output_size_per_class", "op": "Const", "input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/combined_non_max_suppression/iou_threshold", "op": "Const", "input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["input", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_65", "op": "NoOp", "input": ["^StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/Conv2D/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu/LeakyRelu"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_1/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d/MaxPool", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_1/LeakyRelu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_2/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_2/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_2/LeakyRelu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_3/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_3/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_3/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_4/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_4/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_4/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_4/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_4/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_5/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_4/MaxPool", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_5/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_5/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_5/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_5/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_6/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/max_pooling2d_5/MaxPool", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_6/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/conv2d_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_6/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/batch_normalization_6/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/batch_normalization_7/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_6/LeakyRelu", "StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/conv2d_7/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/conv2d_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/leaky_re_lu_7/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/batch_normalization_7/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/batch_normalization_8/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_8/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/batch_normalization_9/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_0/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/conv2d_10/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/conv2d_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/leaky_re_lu_8/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_0/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/leaky_re_lu_9/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/batch_normalization_9/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_0/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/leaky_re_lu_9/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/Shape", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/strided_slice_1/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Shape", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Shape", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/strided_slice_1/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/mul", "op": "Mul", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/Const", "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape/shape/1", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/strided_slice", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/strided_slice_1", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape/3", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_0/conv2d_9/BiasAdd", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/yolov3_tiny/yolo_darknet/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape/3"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/split", "op": "SplitV", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Const", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape/shape/1"], "attr": {"num_split": {"i": "4"}, "Tlen": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/batch_normalization_10/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_conv_1/concatenate/concat", "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_11/Conv2D_weights", "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Shape", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/leaky_re_lu_10/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_1/batch_normalization_10/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1", "op": "Range", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1/start", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Exp", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/mul"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_2", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Sigmoid_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_4", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Sigmoid_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_1/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/Conv2D/ReadVariableOp", "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Size_1", "op": "Size", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_2", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_2", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_1/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_4", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_4", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_5", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_4", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_1/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/ones/packed", "op": "Pack", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Size_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Size_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_2", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape/shape/1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_4", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape/shape/1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_5"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/Shape", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/Shape", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/strided_slice_1/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/ones", "op": "Fill", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/ones/packed", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1/delta"], "attr": {"T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Sigmoid_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Sigmoid_2", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape/shape/1", "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/strided_slice", "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/strided_slice_1", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape/3", "StatefulPartitionedCall/yolov3_tiny/yolo_output_0/lambda/Reshape/shape/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/mul", "op": "Mul", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape_2", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/ones"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape_3", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/ones"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_1/conv2d_12/BiasAdd", "StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/stack", "op": "Pack", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/mul", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/mul_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "-1"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/split", "op": "SplitV", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_output_1/lambda_1/Reshape", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Const", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Reshape/shape/1"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Shape", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/ExpandDims"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/range_1", "op": "Range", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1/start", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/strided_slice", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/strided_slice"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Exp", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/mul"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_8", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Sigmoid_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_10", "op": "Shape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/Sigmoid_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/add", "op": "AddV2", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Cast", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/meshgrid/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/range_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/meshgrid/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/range_1", "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_0/meshgrid/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/meshgrid/Size_1", "op": "Size", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_boxes_1/range_1"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_8", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_8", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_9", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yolov3_tiny/yolo_nms/Shape_8", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice_1/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack", "StatefulPartitionedCall/yolov3_tiny/yolo_nms/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "T": {"type": 